# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и через dict.

lst = [[12, 1, 2], [3, 4, 5], [6, 7, 8], [9, 10, 11]]
month = int(input("Ввеите номер месяца: "))
for i,j in enumerate(lst):
    if month in j:
        if i == 0:
            print('Зима')
        elif i == 1:
            print("Весна")
        elif i == 2:
            print("Лето")
        elif i == 3:
            print("Осень")

months = {"Зима": [12, 1, 2], "Весна": [3, 4, 5],"Лето": [6, 7, 8], "Осень": [9, 10, 11]}
for a, b in months.items():
    if month in b:
        print(a)
